# ControlWork_1

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

# Основная программа

string[] array = new string[] {"Hello", "2", "world", ":-)", ...}; // Ввод данных массива

int sizeNewArray = GetSizeNewArray(array); // Нахождение размера нового массива через функцию GetSizeNewArray

string[] finalArray = MakeFinalArray(array, sizeNewArray); // Создание нового массива из имеющегося и размера через функцию MakeFinalArray

PrintArray(array);           // Вывод в терминал через функцию PrintArray

Console.Write(" -> ");       // Вывод в строку терминала ->

PrintArray(finalArray);      // Вывод в терминал через функцию PrintArray

# Функции

## Функция int GetSizeNewArray(string[] massive) // Получение размера нового массива

    int count = 0; // Счетчик подходящих элементов массива под условие задачи для размера нового массива
    for (int i = 0; i < massive.Length; i++) // Цикл for для прохода по всему массиву
    {
        if (massive[i].Length <= 3) // Условие увеличения счётчика
        {
            count++; // Увеличение счетчика на 1
        }
    }
    return count; // Возврат счетчика

## Функция string[] MakeFinalArray(string[] massive, int size) // Создание нового массива с нужным размером и заполнеие его

    string[] finalMassive = new string[size]; // Создание нового массива с  нужным размером

    int index = 0; // Индекс нового массива
    for (int i = 0; i < massive.Length; i++) // Цикл for для прохода по всему массиву
    {
        if (massive[i].Length <= 3) // Условие записи элемента массива в новый массив и увеличения индекса нового массива
        {
            finalMassive[index] = massive[i]; // Запись элемента массива в новый массив
            index++; // Увеличение индекса
        }
    }
    return finalMassive; // Возврат нового массива

## Функция void PrintArray(string[] massive) // Вывод массива в строку терминала

    Console.Write("["); // Вывод в строку терминала "["
    for (int i = 0; i < massive.Length - 1; i++) // Цикл for для прохода по массиву до предпоследнего элемента
    {
        Console.Write($"”{massive[i]}”, "); // Вывод в строку терминала элемент массива
    }
    Console.Write($"”{massive[massive.Length - 1]}”]"); // Вывод в строку терминала последний элемент массива и "]"
